Revit 2024 API
StructuralSectionGeneralW Class
 Defines parameters for Angle structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralW : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionGeneralW _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionGeneralW : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
See Also
StructuralSectionGeneralW Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace